tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "versent/taps"
brew "awscli", args: ["HEAD"]
brew "cloc"
brew "gh"
brew "go"
brew "gradle"
brew "grpcurl"
brew "helm"
brew "jenv"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "maven"
brew "neovim"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "protobuf"
brew "redis"
brew "ripgrep"
brew "rust"
brew "sketchybar"
brew "rustup"
brew "saml2aws"
brew "stow"
brew "tmux"
brew "trash"
brew "tomcat@9"
brew "wget"
brew "less"
brew "zsh-autosuggestions"
brew "felixkratz/formulae/borders"
cask "aerospace"
cask "chromium"
cask "dbeaver-community"
cask "unnaturalscrollwheels"
cask "wezterm"
cask "google-chrome"
cask "visual-studio-code"
cask "mullvad-vpn"
cask "alt-tab"
cask "bitwarden"
cask "chatgpt"
cask "clipy"
cask "cursor"
cask "discord"
cask "mediamate"
cask "parsec"
cask "postgres-unofficial"
cask "postman"
cask "spotify"
cask "unnaturalscrollwheels"
cask "zoom"
cask "obs"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "oracle.mysql-shell-for-vs-code"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
