tap "sqitchers/sqitch"
tap "sst/tap"
cask "mactex"
brew "act"
brew "azure-cli"
brew "checkstyle"
brew "perl"
brew "clang-format"
brew "cmake"
cask "zoom"
brew "gnutls"
cask "discord"
cask "parsec"
cask "obs"
mas "Bitwarden", id: 1352778147
cask "postgres-app"
brew "postgresql@16"
brew "rust"
brew "rustup"
brew "bun"
cask "mullvad-vpn"
brew "opencode"
brew "python@3.14"
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"
brew "gemini-cli"
brew "golang-migrate"
brew "doctl"
brew "dotenvx/brew/dotenvx"
brew "just"
brew "pulumi"
brew "sops"
brew "sbt"
brew "sqitch"
brew "libpq"
cask "steamcmd"
brew "azure/kubelogin/kubelogin"
brew "withgraphite/tap/graphite"
