tap "sqitchers/sqitch"
tap "nikitabobko/tap"
tap "fortio/homebrew-tap"
cask "aerospace"
brew "fps"
cask "chromium"
cask "claude"
cask "claude-code"
cask "helium-browser"
tap "sst/tap"
cask "mactex"
brew "act"
brew "azure-cli"
brew "checkstyle"
brew "perl"
brew "clang-format"
brew "cmake"
cask "zoom"
brew "gnutls"
cask "discord"
cask "parsec"
cask "obs"
mas "Bitwarden", id: 1352778147
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "BlockSite Block Websites & Stay Focused", id: 6743401868
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MyWallpaper", id: 1552826194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PairVPN", id: 1347012179
cask "postgres-app"
brew "postgresql@16"
brew "rust"
brew "rustup"
brew "bun"
cask "mullvad-vpn"
brew "opencode"
brew "python@3.14"
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"
brew "gemini-cli"
brew "golang-migrate"
brew "doctl"
brew "dotenvx/brew/dotenvx"
brew "just"
brew "pulumi"
brew "sops"
brew "sbt"
brew "sqitch"
brew "libpq"
cask "steamcmd"
brew "azure/kubelogin/kubelogin"
brew "withgraphite/tap/graphite"
